<script setup lang="ts">
let grammers = [
  {
    ja: "こんな",
    zhTW: "這樣的、這麼的、如此的",
  },
  {
    ja: "そんな",
    zhTW: "那樣的",
  },
  {
    ja: "あんな",
    zhTW: "那樣的",
  },
  {
    ja: "こう",
    zhTW: "這樣、這麼",
  },
  {
    ja: "そう",
    zhTW: "那樣、那麼",
  },
  {
    ja: "ああ",
    zhTW: "那樣",
  },
  {
    ja: "ちゃ、ちゃう",
    zhTW: "ては、てしまう的縮略形式",
  },
  {
    ja: "~が",
    zhTW: "表後面的動作或状態的主體",
  },
  {
    ja: "までに",
    zhTW: "在~之前、到~時候為止",
  },
  {
    ja: "數量詞+も",
    zhTW: "多達...",
  },
  {
    ja: "ばかり",
    zhTW: "淹...光...總是...老是...",
  },
  {
    ja: "でも",
    zhTW: "...之類的、就連~也",
  },
  {
    ja: "疑問詞+でも",
    zhTW: "無論~、不論~、不拘",
  },
  {
    ja: "疑問詞+か",
    zhTW: "表事態的不明確性",
  },
  {
    ja: "とか~とか",
    zhTW: "~啦~啦、~或~或、及",
  },
  {
    ja: "し",
    zhTW: "既...又...、不僅...而且...",
  },
  {
    ja: "の",
    zhTW: "...嘛",
  },
  {
    ja: "だい",
    zhTW: "...呢...呀",
  },
  {
    ja: "かい",
    zhTW: "...嗎",
  },
  {
    ja: "な (禁止)",
    zhTW: "不准...、不要...",
  },
  {
    ja: "さ",
    zhTW: "表程度或狀態",
  },
  {
    ja: "らしい",
    zhTW: "好像...、似乎...、說是...、好像...、像...樣子、有...風度",
  },
  {
    ja: "がる (がらない)",
    zhTW: "覺得...(不覺得...)、想要...(不想要...)",
  },
  {
    ja: "たがる (たがらない)",
    zhTW: "想...(不想...)",
  },
  {
    ja: "(ら)れる (被動)",
    zhTW: "被...",
  },
  {
    ja: "お~になる、ご~になる",
    zhTW: "表動詞尊敬語的形式",
  },
  {
    ja: "(ら)れる (尊敬)",
    zhTW: "表對對方或話題人物的尊敬",
  },
  {
    ja: "お+名詞、ご+名詞",
    zhTW: "表尊敬、鄭重、親愛",
  },
  {
    ja: "お~する、ご~する",
    zhTW: "表動詞的謙譲形式",
  },
];
grammers = grammers.sort((a, b) => (a.ja > b.ja ? 1 : -1));
</script>

<template>
  <div>
    <ul>
      <li
        class="grid grid-cols-2 gap-2"
        v-for="grammer in grammers"
        :key="grammer.ja"
      >
        <span>{{ grammer.ja }}</span>
        <span>{{ grammer.zhTW }}</span>
      </li>
    </ul>
  </div>
</template>
